Antonio-1110/RB4107_AY2627/firmware/16_fault_manager/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
# Waveshare ESP32-S3-ETH-8DI-8RO: at least 4 MB flash; the networked builds
# need more than the default 1 MB app partition.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
